Autodesk.Revit.DB.Subelement.CanHaveTypeAssigned
Identifies if the subelement can have a type assigned.
Remarks:
Some subelements cannot have type assigned,
in which case invalid element id is considered to be their type id.
Returns:
True if subelement can have a type assigned, false otherwise.
Since:
2018

Autodesk.Revit.DB.Subelement.IsValidSubelementReference(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference)
Checks if given Reference identifies either a valid element or subelement.
Remarks:
A reference to an element or subelement in a linked document is acceptable.
aDoc:
The document.
reference:
The reference that identifies an element or subelement.
Returns:
True if %reference% identifies a valid element or subelement, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Subelement.HasParameter(Autodesk.Revit.DB.ElementId)
Checks if this subelement have given parameter.
parameterId:
Parameter id.
Returns:
True if %parameterId% identifies valid parameter of this subelement, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Subelement.GetReference
Obtains the reference to this subelement.
Returns:
The reference to this subelement.
Since:
2018

Autodesk.Revit.DB.Subelement.GetBoundingBox(Autodesk.Revit.DB.View)
Retrieves a box that circumscribes all geometry of the subelement.
Remarks:
Pass in a view to query view-specific (e.g., cut) geometry or null for model
geometry. If the view box is not known or cannot be calculated, this will return the model box;
if the model box is not known,
this will return null. The box will always be aligned to the default axes of the
model coordinate system (thus no rotation should be applied to the return value).
Also note that this bounding box volume
may enclose geometry that is not obvious. For example, the "flip controls" that
could be part of a family will be included in the computation of the bounding box even
though they are not always visible in the family instance of the family.
dbView:
The view for view-specific geometry or null for model geometry.
Returns:
The bounding box.
Since:
2018

Autodesk.Revit.DB.Subelement.GetGeometryObject(Autodesk.Revit.DB.View)
Retrieve one geometric primitive representing given subelement.
Remarks:
In case of whole element, geometric object representing element and its subelements will be returned.
null will be returned if related geometric object could not be found in the model.
dbView:
The view for view-specific geometry or null for model geometry.
Returns:
The geometric object representing this subelement.
Since:
2018

Autodesk.Revit.DB.Subelement.IsParameterModifiable(Autodesk.Revit.DB.ElementId)
Checks if given parameter of this subelement is modifiable.
parameterId:
Parameter id.
Returns:
True if given parameter of this subelement is modifiable, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Subelement.SetParameterValue(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ParameterValue)
Sets a new parameter value of this subelement given a parameter id.
parameterId:
Parameter id.
pValue:
New value for the parameter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
parameterId does not identify a valid parameter of this subelement.
-or-
The parameter parameterId is not modifiable for this subelement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Subelement.GetParameterValue(Autodesk.Revit.DB.ElementId)
Obtains the current parameter value of this subelement given a parameter id.
parameterId:
Parameter id.
Returns:
Parameter value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
parameterId does not identify a valid parameter of this subelement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Subelement.GetAllParameters
Returns all parameters of this subelement.
Since:
2018

Autodesk.Revit.DB.Subelement.ChangeTypeId(Autodesk.Revit.DB.ElementId)
Changes the type of the subelement.
Remarks:
In rare cases, applying a change in type will result in a new element being created.
The only active examples of this are when:
Applying a normal wall type to a curtain panel. Converting such a wall back to a curtain panel. Applying a new type to a railing subelement.
In this situation this subelement object will be redirected to the new element.
typeId:
Identifier of the type to assign to this subelement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The type typeId is not valid for this subelement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This Subelement cannot have type assigned.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
This Subelement is an internal element, such as a component of a
loaded family or a group type.
-or-
The document containing this Subelement is in Group Edit Mode,
Sketch Edit Mode, or Paste Mode, and the element is not a
member of the group, sketch, or clipboard.
-or-
This Subelement is a member of a group or sketch, and the document
is not currently editing the group or sketch.
Since:
2018

Autodesk.Revit.DB.Subelement.GetValidTypes
Obtains a set of types that are valid for this subelement.
Remarks:
A type is valid for a subelement if it can be assigned to the subelement.
Returns:
A set of element IDs of types that are valid for this subelement or an empty set if subelement cannot have type assigned.
Since:
2018

Autodesk.Revit.DB.Subelement.IsValidType(Autodesk.Revit.DB.ElementId)
Checks if given type is valid for this subelement.
Remarks:
A type is valid for a subelement if it can be assigned to the subelement.
typeId:
ElementId of the type to check.
Returns:
True if subelement can have a type assigned and this type is valid for this subelement, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Subelement.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference)
Creates an object representing element or subelement.
Remarks:
If %reference% points to linked document:
The Autodesk.Revit.DB.Subelement.GetReference method of the newly created subelement will return the local reference in the linked document. The Autodesk.Revit.DB.Subelement.Document property of the newly created subelement will return the linked document.
aDoc:
The document.
reference:
The reference that identifies element or subelement.
Returns:
The newly created subelement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
reference does not identify a valid element or subelement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Subelement.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Subelement.UniqueId
A stable unique identifier for this subelement within the document.
Since:
2018

Autodesk.Revit.DB.Subelement.Element
The element in which the subelement resides.
Remarks:
If subelement refers to whole element, this element is returned.
Since:
2018

Autodesk.Revit.DB.Subelement.Document
The document in which the subelement resides.
Since:
2018

Autodesk.Revit.DB.Subelement.TypeId
The identifier of this subelement's type.
Remarks:
Some subelements cannot have type assigned,
in which case this method returns invalid element id.
Since:
2018

Autodesk.Revit.DB.Subelement.Category
Retrieves a Category object that represents the category or sub category of the subelement.
Remarks: All category objects can be retrieved from the application by using the Categories property
of the Application.Settings object.

Autodesk.Revit.DB.Subelement
An object that represents an element or a subelement within the Autodesk Revit project.
Remarks:
Subelements provide a way for parts of an element to behave as though they were real elements without incurring the overhead of adding more full elements to the model.
Many Revit features (for example parameters, schedules, and tags) were designed to operate on Elements.
As a result, the Revit code needs to represent objects as Elements for them to participate in those features.  This can lead to scalability problems,
because every Element adds overhead and adding many Elements may decrease the performance of the model. An alternative is to use Subelements.  An element
can expose a set of "Subelements" that it contains, specifying characteristics like their category and parameters,
and certain Revit capabilities will treat those Subelements the same as ordinary Elements.  For example, a Subelement may contribute geometry to the main element
and may be able to be selected independently of its parent Element.  It will possibly have its own (settable) type as well as an assigned category which
can be different from its parent Element.
In the API, the new Subelement class is used to refer to either an Element or a specific subelement of a given Element.
It is typically directly related to a Reference to either the Element or the specific subelement.
Note that creation of new Subelements for a given element is not done generically.  Instead, the given Element may provide the ability to modify it's definition,
resulting in the creation of new Subelements.
Examples of Elements which may have Subelements in practice include:
Autodesk.Revit.DB.Structure.RebarContainerAutodesk.Revit.DB.Structure.RebarAutodesk.Revit.DB.Structure.FabricSheetAutodesk.Revit.DB.Architecture.Stairs elements which make up Autodesk.Revit.DB.Architecture.MultistoryStairs elementsAutodesk.Revit.DB.Architecture.RailingAutodesk::Revit::DB::Architecture::ContinuousRail
To get access to a particular Subelement, you may use any of the following:
Autodesk.Revit.DB.Subelement.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference)Autodesk.Revit.DB.Subelement.IsValidSubelementReference(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Reference)Autodesk.Revit.DB.Document.GetSubelement(Autodesk.Revit.DB.Reference) if you have a Reference to a Subelement.Autodesk.Revit.DB.Document.GetSubelement(String) if you have a unique id of a Subelement.Autodesk.Revit.DB.Element.GetSubelements
Since:
2018